Timmy880520/BBUBU163AEN01/PRI/APP/Libraries/EventLog/Source/f28004x_i2c_driver.c
/**************************************************************************************************
File Name: f28004x_i2c_driver.c
External Data:
    Name                                    Source
    --------------------------------------- -----------------------------------------------------
    None.
External Functions:
    Name                                    Source
    --------------------------------------- -----------------------------------------------------
    EALLOW                                  F28004x_device.h
    EDIS                                    F28004x_device.h
Description:
    EEPROM I2C bus transmission and reception driver. The driver shall be created and filled in
the required data in the parameters of the driver before executing any function in the driver.

==================================================================================================
History:
    Date       Author           Description of Change
    ---------- ---------------- -----------------------------------------------------------------
    09/15/2020 Fred Huang       1. Ver. 1.0


**************************************************************************************************/

/* Includes */
#include "../../EventLog/Include/f28004x_i2c_driver.h"

#include "Io.h"
//------------------------------------------------------------------------------
// Local function prototypes
//------------------------------------------------------------------------------
unsigned char I2C_Master_Start_Packet(mI2cObj *obj, I2cTransmitMode trx);
unsigned char I2C_Master_Stop_Packet(mI2cObj *obj);
unsigned char I2C_Master_Transmit(mI2cObj *obj);
unsigned char I2C_Master_Receive(mI2cObj *obj);
unsigned char I2C_Master_TXD_Packet(mI2cObj *obj);
unsigned char I2C_Master_RXD_Packet(mI2cObj *obj);
void I2C_Master_Parameter_Reset(mI2cObj *obj);
//------------------------------------------------------------------------------
// Data definitions
//------------------------------------------------------------------------------


//------------------------------------------------------------------------------
// Local functions
//------------------------------------------------------------------------------
/**************************************************************************************************
Function Name:
    unsigned char I2C_Master_Send_Start(mI2cObj *obj)
Input:
    *obj    - Pointer of driver object.
    trx     - Transfer mode select bit.
                1 = Transmitter mode(R/W = 0).
                0 = Receiver mode(R/W = 1).
Output:
    return  - Result. 1 = completed, 0 = not complete.
Comment:
    I2C master send start packet included slave address and R/W bit. The parameters of state
    machine shall be specified before executing this function(address, rxdPtr, txdPtr, rxSize
    , and txSize).
**************************************************************************************************/
unsigned char I2C_Master_Start_Packet(mI2cObj *obj, I2cTransmitMode trx)
{
    if(obj->member.reg->I2CSTR.bit.ARBL)
    {
        obj->member.reg->I2CSTR.bit.ARBL = 1; //Write a 1 to it to clear it.
        if(trx == I2C_TRANSMITTER_MODE)
        {
            obj->member.txStep = 0;
            obj->member.txSubStep = 0;
        }
        else
        {
            obj->member.rxStep = 0;
        }
    }
    else if(obj && trx == I2C_TRANSMITTER_MODE)
    {
        if(obj->member.txStep == 0)
        {
            if(!obj->member.reg->I2CSTR.bit.BB && obj->member.reg->I2CSTR.bit.XRDY)
            {
                // Slave addressing mask changes with addressing mode
                if(obj->member.reg->I2CMDR.bit.XA == I2C_7bit_ADDRESS)
                {
                    obj->member.reg->I2CSAR.bit.SAR = (obj->member.slaveAddress >> 1) & 0x007F;
                }
                else
                {
                    obj->member.reg->I2CSAR.bit.SAR = (obj->member.slaveAddress >> 1) & 0x03FF;
                }
                // Send slave address and read/write bit.
                obj->member.reg->I2CMDR.bit.RM = 1;
                // Master transmitter mode
                obj->member.reg->I2CMDR.bit.MST = 1;
                obj->member.reg->I2CMDR.bit.TRX = I2C_TRANSMITTER_MODE;
                // Send start condition
                obj->member.reg->I2CMDR.bit.STT = 1;
                obj->member.txStep++;
            }
            obj->member.occupied = 1;

        }
        return (obj->member.txStep > 0);
    }
    else
    {
        if(obj->member.rxStep == 0)
        {
            if(obj->member.reg->I2CSTR.bit.XRDY)
            {
                // Slave addressing mask changes with addressing mode
                if(obj->member.reg->I2CMDR.bit.XA == I2C_7bit_ADDRESS)
                {
                    obj->member.reg->I2CSAR.bit.SAR = (obj->member.slaveAddress >> 1) & 0x007F;
                }
                else
                {
                    obj->member.reg->I2CSAR.bit.SAR = (obj->member.slaveAddress >> 1) & 0x03FF;
                }
                obj->member.reg->I2CMDR.bit.RM = 1;
                // Master transmitter mode
                obj->member.reg->I2CMDR.bit.MST = 1;
                obj->member.reg->I2CMDR.bit.TRX = I2C_RECEIVER_MODE;                // Send slave address and read/write bit.
                // Send start condition
                obj->member.reg->I2CMDR.bit.STT = 1;

//                obj->member.reg->I2CCNT = obj->member.rxSize;
//                obj->member.reg->I2CMDR.bit.RM = 0;
                obj->member.rxStep++;
            }
            obj->member.occupied = 1;
        }
        return (obj->member.rxStep > 0);
    }
    return 0;
}
/**************************************************************************************************
Function Name:
    unsigned char I2C_Master_Stop_Packet(mI2cObj *obj)
Input:
    *obj            - Pointer of driver object.
Output:
    N/A
Comment:
    I2C master send stop condition.
**************************************************************************************************/
unsigned char I2C_Master_Stop_Packet(mI2cObj *obj)
{
    unsigned char dataTrash;
    if(obj->member.reg->I2CSTR.bit.ARBL)
    {
        obj->member.reg->I2CSTR.bit.ARBL = 1; //Write a 1 to it to clear it.
        obj->member.txStep = 0;
        obj->member.txSubStep = 0;
        obj->member.rxStep = 0;
    }
    else if(obj->member.reg->I2CSTR.bit.SCD)     //Stop condition detect
    {
        obj->member.reg->I2CSTR.bit.SCD = 1;// To clear this bit, write a 1 to it.
        // Reset parameters  of I2C state machine
        obj->member.txStep = 0;
        obj->member.txSubStep = 0;
        obj->member.rxStep = 0;
        obj->member.occupied = 0;
        obj->member.transmitting = 0;
        obj->member.receiving = 0;
        //        I2C_SW_Reset(obj);
        return 1;

