Timmy880520/BBUBU163AEN01/PRI/APP/Libraries/EventLog/Source/f28004x_i2c_driver.c
    }
    else if (obj->member.reg->I2CSTR.bit.ARDY == 1 || obj->member.reg->I2CMDR.bit.TRX == I2C_RECEIVER_MODE)
    {

        // Send stop condition
        obj->member.reg->I2CMDR.bit.STP = 1;
        if(obj->member.reg->I2CSTR.bit.RRDY)
        {
            dataTrash = obj->member.reg->I2CDRR.bit.DATA;
            dataTrash = dataTrash ? 0 : dataTrash;
        }

    }
    return 0;
}
/**************************************************************************************************
Function Name:
    unsigned char I2C_Master_TXD_Packet(mI2cObj *obj)
Input:
    *obj     - Object of I2C peripheral and parameters of state machine for I2C driver.
Output:
    return   - Result. 1 = completed, 0 = not complete.
Comment:
    I2C master mode transmit data function, the total number of bytes shall be less than
254 bytes.
**************************************************************************************************/
unsigned char I2C_Master_TXD_Packet(mI2cObj *obj)
{
    if(obj->member.txStep == 255)
        return 1;

    if(obj->member.txStep > 0)
    {
        if(obj->member.reg->I2CSTR.bit.XRDY)
        {
            obj->member.occupied = 0;

            if(obj->member.txStep < (obj->member.txSize + 1))
            {
                obj->member.reg->I2CDXR.bit.DATA = *(obj->member.txdPtr + obj->member.txStep - 1);
                obj->member.reg->I2CSTR.bit.ARDY = 1;   //Clear ARDY manually when write new data to I2CDXR
                if(obj->member.txStep < obj->member.txSize)
                {
                    obj->member.txStep++;
                }
                else
                {
                    obj->member.txStep = 255;
                    return 1;
                }
            }
            else
            {
                obj->member.txStep = 255;
                return 1;
            }
        }
        else
        {
            if(obj->member.reg->I2CSTR.bit.NACK)
            {
                //LED_TOGGLE();
                //obj->member.txStep = 0;
                //obj->member.txSubStep = 0;
                obj->member.reg->I2CSTR.bit.NACK = 1;
                //obj->member.reg->I2CMDR.bit.STP = 1;
                I2C_SW_Reset(obj);
            }
            obj->member.occupied = 1;
        }
    }
    return 0;
}
/**************************************************************************************************
Function Name:
    unsigned char I2C_Master_RXD_Packet(mI2cObj *obj)
Input:
    *obj     - Object of I2C peripheral and parameters of state machine for I2C driver.
Output:
    return   - Result. 1 = completed, 0 = not complete.
Comment:
    I2C master mode receive data function, the total number of bytes shall be less than
254 bytes.
**************************************************************************************************/
unsigned char I2C_Master_RXD_Packet(mI2cObj *obj)
{
    unsigned char dataTrash;

    if(obj->member.rxStep == 255)
    {
        return 1;
    }

    if(obj->member.rxStep > 0)
    {
        if(obj->member.reg->I2CSTR.bit.RRDY)
        {

            obj->member.occupied = 0;

            if(obj->member.rxStep < (obj->member.rxSize + 1))
            {
                *(obj->member.rxdPtr + obj->member.rxStep - 1) = obj->member.reg->I2CDRR.bit.DATA;
//                obj->member.rxStep++;
                if(obj->member.rxStep < obj->member.rxSize)
                {
                    if(++obj->member.rxStep >= obj->member.rxSize)
                    {
                        obj->member.reg->I2CMDR.bit.NACKMOD = 1;
                    }
                }
                else
                {
                    obj->member.rxStep = 255;
                    return 1;
                }
            }
            else
            {
                dataTrash = obj->member.reg->I2CDRR.bit.DATA;
                dataTrash = dataTrash ? 0 : dataTrash;
                obj->member.rxStep = 255;
                return 1;
            }
        }
        else
        {
            obj->member.occupied = 1;
        }
        if(obj->member.rxSize == 0)
        {
            obj->member.rxStep = 255;
            return 1;
        }

/*        if(obj->member.rxStep >= obj->member.rxSize + 1)
        {
            obj->member.reg->I2CMDR.bit.NACKMOD = 1;
            obj->member.rxStep = 255;
            return 1;
        }*/
    }
    return 0;
}
/**************************************************************************************************
Function Name:
    unsigned char I2C_Master_Transmit(mI2cObj *obj)
Input:
    *obj     - Object of I2C peripheral and parameters of state machine for I2C driver.
Output:
    return   - Result. 1 = completed, 0 = not complete.
Comment:
    I2C master mode sequence transmit function. The parameters of state machine shall be specified
before executing this function(address, rxdPtr, txdPtr, rxSize, and txSize).
**************************************************************************************************/
unsigned char I2C_Master_Transmit(mI2cObj *obj)
{
    if(I2C_Master_Start_Packet(obj,I2C_TRANSMITTER_MODE))
    {
        if(I2C_Master_TXD_Packet(obj))
        {
            return I2C_Master_Stop_Packet(obj);
        }
    }
    return 0;
}
/**************************************************************************************************
Function Name:
    unsigned char I2C_Master_Receive(mI2cObj *obj)
Input:
    *obj     - Object of I2C peripheral and parameters of state machine for I2C driver.
Output:
    return   - Result. 1 = completed, 0 = not complete.
Comment:
    I2C master mode sequence receive function. The parameters of state machine shall be specified
before executing this function(address, rxdPtr, txdPtr, rxSize, and txSize).
**************************************************************************************************/
unsigned char I2C_Master_Receive(mI2cObj *obj)
{
    if(I2C_Master_Start_Packet(obj, I2C_RECEIVER_MODE))
    {
        if(I2C_Master_RXD_Packet(obj))
        {

            return I2C_Master_Stop_Packet(obj);
        }
    }
    return 0;
}
//------------------------------------------------------------------------------
// Global functions
//------------------------------------------------------------------------------
/**************************************************************************************************
Function Name:
    void I2C_Master_Init(mI2cObj *obj, I2cAddressMode addressMode)
Input:
    *obj        - Pointer of driver object.
    addressMode - I2C addressing mode. 0 = 7-bit, 1 = 10-bit.
Output:
    None.
Comment:
    I2C initialization function. This function will set the mantissa and fraction of baud rate
register and control registers.
**************************************************************************************************/
void I2C_Master_Init(mI2cObj *obj, I2cAddressMode addressMode)
{
    static unsigned short dValue;
    static unsigned short clkTemp;

    // Must put I2C into reset before configuring it
    obj->member.reg->I2CMDR.bit.IRS = 0;
    // I2C module clock = 100MHz / (9 + 1) = 10MHz
    obj->member.reg->I2CPSC.bit.IPSC = obj->member.ipscValue;
    // dValue is an adjustment factor based on the IPSC
    switch(obj->member.ipscValue)
    {
        case 0U:
            dValue = 7U;
            break;

