Timmy880520/BBUBU163AEN01/PRI/APP/Libraries/EventLog/Source/f28004x_i2c_driver.c
        case 1U:
            dValue = 6U;
            break;

        default:
            dValue = 5U;
            break;
    }
    clkTemp = obj->member.periodValue - (2 * dValue);
    obj->member.reg->I2CCLKH = clkTemp >> 1;
    obj->member.reg->I2CCLKL = clkTemp - obj->member.reg->I2CCLKH;

    obj->member.reg->I2CMDR.bit.XA = addressMode;
    obj->member.reg->I2CMDR.bit.BC = 0;         // 8 bits per data byte
//    obj->member.reg->I2CSAR.bit.SAR = 0xA0;     // Initial device ID
    // Enable FIFO
//    obj->member.reg->I2CFFTX.bit.I2CFFEN = 1;
//    obj->member.reg->I2CFFTX.bit.TXFFST = 1;
//    obj->member.reg->I2CFFRX.bit.RXFFST = 1;
    // Enable I2C module
    obj->member.reg->I2CMDR.bit.IRS = 1;        // I2C module is enabled.
}
/**************************************************************************************************
Function Name:
    unsigned char I2C_Master_Process_Transmit(void *obj, unsigned char id,
                                              void *aPtr, unsigned char aSize,
                                              void *dPtr, unsigned char dSize)
Input:
    *obj     - Object of I2C peripheral and parameters of state machine for I2C driver.
    id       - Slave address.
    *aPtr    - Pointer of address part, the function will sequentially send the specified number
               of bytes from the pointer.
    aSize    - Size of address part, the specified number of bytes for address part.
    *dPtr    - Pointer of data part, the function will sequentially send the specified number of
               bytes from the pointer after address part has been transferred.
    dSize    - Size of data part, the specified number of bytes for data part.
Output:
    return   - Result. 1 = completed, 0 = not complete.
Comment:
    I2C master mode process transmit function. The parameters of state machine shall be specified
before executing this function(address, rxdPtr, txdPtr, rxSize, and txSize).
**************************************************************************************************/
unsigned char I2C_Master_Process_Transmit(void *obj, unsigned char id,
                                          void *aPtr, unsigned char aSize,
                                          void *dPtr, unsigned char dSize)
{
    if(obj && ((mI2cObj*)obj)->member.receiving == 0)
    {
        ((mI2cObj*)obj)->member.transmitting = 1;
        ((mI2cObj*)obj)->member.slaveAddress = id;
        if(!((mI2cObj*)obj)->member.txSubStep)
        {
            ((mI2cObj*)obj)->member.txSize = aSize;
            ((mI2cObj*)obj)->member.txdPtr = aPtr;

            if(I2C_Master_Start_Packet(((mI2cObj*)obj), I2C_TRANSMITTER_MODE) && I2C_Master_TXD_Packet(((mI2cObj*)obj)))
            {
                ((mI2cObj*)obj)->member.txSubStep = 1;
                ((mI2cObj*)obj)->member.txStep = 1;
            }
        }
        else
        {
            ((mI2cObj*)obj)->member.txSize = dSize;
            ((mI2cObj*)obj)->member.txdPtr = dPtr;

            if(I2C_Master_TXD_Packet(((mI2cObj*)obj)))
            {
                return I2C_Master_Stop_Packet(((mI2cObj*)obj));
            }
        }

    }
    return 0;
}
/**************************************************************************************************
Function Name:
    unsigned char I2C_Master_Process_Receive(I2cRegStr *reg,
                                             void *aPtr, unsigned char aSize,
                                             void *dPtr, unsigned char dSize)
Input:
    *reg     - Registers of I2C peripheral and parameters of state machine for I2C driver.
    *aPtr    - Pointer of address part, the function will sequentially send the specified number
               of bytes from the pointer.
    aSize    - Size of address part, the specified number of bytes for address part.
    *dPtr    - Pointer of data part, the function will sequentially receive the specified number
               of bytes to the pointer after address part has been transferred.
    dSize    - Size of data part, the specified number of bytes for data part.
Output:
    return   - Result. 1 = completed, 0 = not complete.
Comment:
    I2C master mode process receive function. The parameters of state machine shall be specified
before executing this function(address, rxdPtr, txdPtr, rxSize, and txSize).
**************************************************************************************************/
unsigned char I2C_Master_Process_Receive(void *obj, unsigned char id,
                                         void *aPtr, unsigned char aSize,
                                         void *dPtr, unsigned char dSize)
{
    if(obj && ((mI2cObj*)obj)->member.transmitting == 0)
    {
        ((mI2cObj*)obj)->member.receiving = 1;
        ((mI2cObj*)obj)->member.slaveAddress = id;
        ((mI2cObj*)obj)->member.txdPtr = aPtr;
        ((mI2cObj*)obj)->member.rxdPtr = dPtr;
        ((mI2cObj*)obj)->member.txSize = aSize;
        ((mI2cObj*)obj)->member.rxSize = dSize;

        if(!aSize)
            return I2C_Master_Receive((mI2cObj*)obj);
        else
        {
            if(((mI2cObj*)obj)->member.txSubStep == 0)
            {
                if (I2C_Master_Start_Packet((mI2cObj*)obj, I2C_TRANSMITTER_MODE))
                {
                    if(I2C_Master_TXD_Packet((mI2cObj*)obj))
                        ((mI2cObj*)obj)->member.txSubStep = 1;
                }
            }
            else
            {
                return I2C_Master_Receive((mI2cObj*)obj);
            }
        }
    }
    return 0;
}

/**************************************************************************************************
Function Name:
    unsigned char I2C_Master_Parameter_Reset(I2cMasterObj *obj)
Input:
    *obj     - Object pointer of master I2C driver.
Output:
    None.
Comment:
    I2C master mode state machine reset function.
**************************************************************************************************/
void I2C_Master_Parameter_Reset(mI2cObj *obj)
{
    obj->member.slaveAddress = 0;
    obj->member.txSize = 0;
    obj->member.rxSize = 0;
    obj->member.occupied = 0;
    obj->member.txStep = 0;
    obj->member.txSubStep = 0;
    obj->member.rxStep = 0;
    obj->member.txdPtr = 0;
    obj->member.rxdPtr = 0;
    obj->member.transmitting = 0;
    obj->member.receiving = 0;
}
/**************************************************************************************************
Function Name:
    unsigned char I2C_SW_Reset(I2cMasterObj *obj)
Input:
    *obj     - Object pointer of master I2C driver.
Output:
    None.
Comment:
    I2C software reset function, it is able to reset the I2C module.
**************************************************************************************************/
void I2C_SW_Reset(mI2cObj *obj)
{
    obj->member.reg->I2CMDR.bit.IRS = 0;

    while (obj->member.reg->I2CMDR.bit.IRS)
        asm(" NOP");                                 // Wait for SW Reset completed

    obj->member.reg->I2CMDR.bit.IRS = 1;

    I2C_Master_Parameter_Reset(obj);
}
/**************************************************************************************************
Function Name:
    unsigned char I2C_Master_Write_FIFO(void *obj, unsigned short *buffer, unsigned short dataCount)
Input:
    *obj            - Pointer of driver object.
    *buffer         - Pointer of the data array.
    dataCount       - Data count.
    slaveAddress    - Slave address.
Output:
    return          - 0 means No data is written.
                      i = Buffer Index, where buffer has been transfered.
Comment:
    I2C transmission function.
**************************************************************************************************/
unsigned char I2C_Master_Write_FIFO(void *obj, unsigned short *buffer, unsigned short dataCount)
{
    static short bufferIndex = 0;
    unsigned short i;

