Timmy880520/BBUBU163AEN01/PRI/APP/Libraries/EventLog/Source/f28004x_i2c_driver.c
    if(obj && !((mI2cObj*)obj)->member.reg->I2CMDR.bit.STP && ((mI2cObj*)obj)->member.reg->I2CSTR.bit.ARDY)
    {
        // Whole packet data count, include slave address and byte index
        ((mI2cObj*)obj)->member.reg->I2CCNT = dataCount;
        // Put buffer into transmit data FIFO
        if(((mI2cObj*)obj)->member.reg->I2CFFTX.bit.TXFFINT)
        {
            if(bufferIndex <= (short)(dataCount - 16))
            {
                for(i = bufferIndex; i < bufferIndex + 16; i++)
                {
                    ((mI2cObj*)obj)->member.reg->I2CDXR.bit.DATA = buffer[i];
                }
                bufferIndex = i;
            }
            else
            {
                for(i = bufferIndex; i < dataCount; i++)
                {
                    ((mI2cObj*)obj)->member.reg->I2CDXR.bit.DATA = buffer[i];
                }
                bufferIndex = 0;
            }
        }
        // Transmitter mode
        ((mI2cObj*)obj)->member.reg->I2CMDR.bit.TRX = 1;

        return i;
    }
    return 0;
}
/**************************************************************************************************
Function Name:
    unsigned char I2C_Master_Read_FIFO(void *obj, unsigned short *buffer, unsigned short dataCount)

Input:
    *obj            - Pointer of driver object.
    *buffer         - Pointer of the data array.
    dataCount       - Data count.
    slaveAddress    - Slave address.
Output:
    return          - Result. 1 = completed. 0 = does not complete.
Comment:
    I2C reception function.
**************************************************************************************************/
unsigned char I2C_Master_Read_FIFO(void *obj, unsigned short *buffer, unsigned short dataCount)
{
    static short bufferIndex = 0;
    unsigned short i;

    if(obj && !((mI2cObj*)obj)->member.reg->I2CMDR.bit.STP)
    {
        // Whole packet data count, include slave address and byte index
        ((mI2cObj*)obj)->member.reg->I2CCNT = dataCount;
        // Put buffer into transmit data FIFO(16-deep)
        if(bufferIndex <= (short)(dataCount - 16))
        {
            for(i = bufferIndex; i < bufferIndex + 16; i++)
            {
                buffer[i] = ((mI2cObj*)obj)->member.reg->I2CDRR.bit.DATA;
            }
            bufferIndex = i;
        }
        else
        {
            for(i = bufferIndex; i < dataCount; i++)
            {
                buffer[i] = ((mI2cObj*)obj)->member.reg->I2CDRR.bit.DATA;
            }
            bufferIndex = 0;
        }

        return 1;
    }
    return 0;
}
//---------------- END LINE -----------------------------------------------------------------------
